In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [3]:
titanic = sns.load_dataset('titanic')

In [8]:
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [10]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [14]:
def impute_age(cols):
    age = cols[0]
    pclass = cols[1]

    if pd.isnull(age):
        if pclass == 1:
            return titanic[titanic['pclass'] == 1]['age'].mean()
        elif pclass == 2:
            return titanic[titanic['pclass'] == 2]['age'].mean()
        elif pclass == 3:
            return titanic[titanic['pclass'] == 3]['age'].mean()

    else:
        return age

In [70]:
titanic['age'] = titanic[['age', 'pclass']].apply(impute_age, axis = 1)

C:\Users\saikr\AppData\Local\Temp\ipykernel_46752\1826968510.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  age = cols[0]
C:\Users\saikr\AppData\Local\Temp\ipykernel_46752\1826968510.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  pclass = cols[1]

In [18]:
titanic.drop(labels=['deck', 'embark_town', 'alive'], inplace = True, axis = 1)

In [20]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    891 non-null    int64
 1   pclass      891 non-null    int64
 2   sex         891 non-null    object
 3   age         891 non-null    float64
 4   sibsp       891 non-null    int64
 5   parch       891 non-null    int64
 6   fare        891 non-null    float64
 7   embarked    889 non-null    object
 8   class       891 non-null    category
 9   who         891 non-null    object
 10  adult_male  891 non-null    bool
 11  alone       891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(3)
memory usage: 65.5+ KB

In [22]:
common_value = 'S'
titanic['embarked'].fillna(common_value, inplace = True)

In [24]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    891 non-null    int64
 1   pclass      891 non-null    int64
 2   sex         891 non-null    object
 3   age         891 non-null    float64
 4   sibsp       891 non-null    int64
 5   parch       891 non-null    int64
 6   fare        891 non-null    float64
 7   embarked    891 non-null    object
 8   class       891 non-null    category
 9   who         891 non-null    object
 10  adult_male  891 non-null    bool
 11  alone       891 non-null    bool
dtypes: bool(2), category(1), float64(2), int64(4), object(3)
memory usage: 65.5+ KB

In [26]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,True

In [28]:
titanic['fare'] = titanic['fare'].astype('int')
titanic['age'] = titanic['age'].astype('int')
titanic['pclass'] = titanic['pclass'].astype('int')

titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   survived    891 non-null    int64
 1   pclass      891 non-null    int32
 2   sex         891 non-null    object
 3   age         891 non-null    int32
 4   sibsp       891 non-null    int64
 5   parch       891 non-null    int64
 6   fare        891 non-null    int32
 7   embarked    891 non-null    object
 8   class       891 non-null    category
 9   who         891 non-null    object
 10  adult_male  891 non-null    bool
 11  alone       891 non-null    bool
dtypes: bool(2), category(1), int32(3), int64(3), object(3)
memory usage: 55.1+ KB

Convert catogorical data into numerical data

In [31]:
genders = {'male': 0, 'female': 1}
titanic['sex'] = titanic['sex'].map(genders)

In [33]:
who = {'man': 0, 'women': 1, 'child': 2}
titanic['who'] = titanic['who'].map(who)

In [39]:
adult_male = {True: 1, False: 0}
titanic['adult_male'] = titanic['adult_male'].map(adult_male)

In [41]:
alone = {True: 1, False: 0}
titanic['alone'] = titanic['alone'].map(alone)

In [43]:
ports = {'S': 0, 'C': 1, 'Q': 2}
titanic['embarked'] = titanic['embarked'].map(ports)

In [45]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,alone
0,0,3,0,22,1,0,7,0,Third,0.0,1,0
1,1,1,1,38,1,0,71,1,First,NaN,0,0
2,1,3,1,26,0,0,7,0,Third,NaN,0,1
3,1,1,1,35,1,0,53,0,First,NaN,0,0
4,0,3,0,35,0,0,8,0,Third,0.0,1,1

In [47]:
titanic.drop(labels = ['class', 'who'], axis = 1, inplace= True)

In [49]:
titanic.head()

   survived  pclass  sex  age  sibsp  parch  fare  embarked  adult_male  alone
0         0       3    0   22      1      0     7         0           1      0
1         1       1    1   38      1      0    71         1           0      0
2         1       3    1   26      0      0     7         0           0      1
3         1       1    1   35      1      0    53         0           0      0
4         0       3    0   35      0      0     8         0           1      1

Build Different Classification Model

In [56]:
from sklearn.linear_model import LogisticRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.svm import SVC
from sklearn.neighbors import KNeighborsClassifier

In [58]:
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score

In [60]:
X = titanic.drop('survived', axis = 1)
y = titanic['survived']

X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.33, random_state = 42)

In [62]:
X_train.shape

(596, 9)

In [109]:
model = []
model.append(('LR', LogisticRegression(max_iter = 800)))
model.append(('KNN', KNeighborsClassifier()))
model.append(('DTC', DecisionTreeClassifier()))
model.append(('GNB', GaussianNB()))
model.append(('SVC', SVC()))

In [113]:
for name, mod in model:
    mod.fit(X_train, y_train)
    prediction = mod.predict(X_test)
    acc_val = accuracy_score(y_test, prediction)
    f1_val = f1_score(y_test, prediction)
    prec_val = precision_score(y_test, prediction)
    rec_val = recall_score(y_test, prediction)
    print("The model is {} and Accuracy: {}, Precision: {}, Recall: {}, f1: {}".format(name, acc_val, prec_val, rec_val, f1_val))

The model is LR and Accuracy: 0.8271186440677966, Precision: 0.8108108108108109, Recall: 0.75, f1: 0.7792207792207791
The model is KNN and Accuracy: 0.7186440677966102, Precision: 0.6831683168316832, Recall: 0.575, f1: 0.6244343891402716
The model is DTC and Accuracy: 0.7898305084745763, Precision: 0.7164179104477612, Recall: 0.8, f1: 0.7559055118110236
The model is GNB and Accuracy: 0.8101694915254237, Precision: 0.7758620689655172, Recall: 0.75, f1: 0.7627118644067795
The model is SVC and Accuracy: 0.6644067796610169, Precision: 0.7441860465116279, Recall: 0.26666666666666666, f1: 0.39263803680981596

In [83]:
from sklearn.metrics import confusion_matrix,accuracy_score,f1_score,precision_score,recall_score

In [81]:
confusion_matrix(y_test, prediction)

array([[164,  11],
       [ 88,  32]], dtype=int64)

In [115]:
32/(32+11)

0.7441860465116279

In [89]:
print("Accuracy score: {}".format(accuracy_score(y_test,prediction)))
print("f1_score: {}".format(f1_score(y_test,prediction)))
print("precision_score: {}".format(precision_score(y_test,prediction)))
print("recall_score: {}".format(recall_score(y_test,prediction)))

Accuracy score: 0.6644067796610169
f1_score: 0.39263803680981596
precision_score: 0.7441860465116279
recall_score: 0.26666666666666666